import { Injectable } from '@nestjs/common';

@Injectable()
export class UserService {
  /****************************************************
   * 方法: 创建用户
   * 参数:
   * 返回:
   * 时间: 2022-04-13
   ****************************************************/
  async createUser(createData) {
    return createData;
  }
  /****************************************************
   * 方法: 跟进id 查询单个用户
   * 参数:
   * 返回:
   * 时间: 2022-04-13
   ****************************************************/
  async findUserById(id: string) {
    return id;
  }
  /****************************************************
   * 方法:查询用户列表
   * 参数:
   * 返回:
   * 时间: 2022-04-13
   ****************************************************/
  async findUserList() {
    return [1, 2, 3, 4];
  }
  /****************************************************
   * 方法:更新指定id 的用户信息
   * 参数:
   * 返回:
   * 时间: 2022-04-13
   ****************************************************/
  async updateUserById(id: string, data: any) {
    return { data };
  }
  /****************************************************
   * 方法:删除指定id 用户
   * 参数:
   * 返回:
   * 时间: 2022-04-13
   ****************************************************/
  async removeUserById(id: string) {
    return id;
  }
}
